<?php

//Задача. Дан массив с элементами 10, 20, 15, 17, 24, 35. Найдите
//сумму элементов этого массива. Запишите ее в переменную $result.
//$arr =  [10, 20, 15, 17, 24, 35];
//$result= 0;
//foreach ($arr as $item) {
//    $result += $item;
//}
//echo $result;
////Задача. Выведите столбец чисел от 1 до 100.
//for ($i = 0; $i<=100; $i++) {
//    echo $i.'<br>';
//}
//Работа с foreach
//    Дан массив с элементами 'html', 'css', 'php', 'js', 'jq'. С помощью цикла
//foreach выведите эти слова в столбик.

//$arr = ['html', 'css', 'php', 'js', 'jq'];
//foreach ($arr as $item) {
//    echo $item. '<br>';
//}


//Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла foreach найдите сумму
//элементов этого массива. Запишите ее в переменную $result.
//$arr = [1, 2, 3, 4, 5];
//$result = 0;
//foreach( $arr as $element ) {
//    $result += $element;
//}
//echo $result;
//
//Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла foreach найдите сумму квадратов
//элементов этого массива. Результат запишите переменную $result.
//$arr = [1, 2, 3, 4, 5];
//    $result = 0;
//foreach ($arr as $item) {
//    $result += ($item**2);
//}
//echo $result;

//Дан массив $arr. С помощью цикла foreach выведите на экран столбец ключей и элементов в формате 'green - зеленый'.
//$arr = ['green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'];
//foreach ($arr as $key => $value ) {
//    echo $key. '=>' .$value.'<br>';
//}
// Дан массив $arr с ключами
//'Коля', 'Вася', 'Петя' и с элементами '200', '300', '400'.
//С помощью цикла foreach выведите на экран
//столбец строк такого формата: 'Коля - зарплата 200 долларов.'.
//$salary =  ['georg' => '1000$' , 'Petr' => '2000$' , 'Kolya' => '3$'];
//foreach ($salary as $key => $value) {
//    echo "$key - zarplata $value dolarov.".'<br>';
//}