<?php
//Работа с переменными
// Создайте переменную $a и присвойте ей значение
// 3. Выведите значение этой переменной на экран.
//
//Создайте переменные $a=10 и $b=2.
// Выведите на экран их сумму, разность, произведение и частное (результат деления).
//
// Создайте переменные $c=15 и $d=2. Просуммируйте их, а результат
// присвойте переменной $result. Выведите на экран значение переменной $result.
//Создайте переменные $a=10, $b=2 и $c=5. Выведите на экран их сумму.
//Создайте переменные $a=17 и $b=10. Отнимите от $a переменную $b и
// результат присвойте переменной $c. Затем создайте переменную $d,
// присвойте ей значение 7. Сложите переменные $c и $d, а результат запишите в переменную $result.
// Выведите на экран значение переменной $result.
//$a = 10;
//echo $a;
$a = 10;
$b = 2;
echo $a+$b;
echo "<br> ";
echo $a-$b;
echo "<br> ";
echo $a*$b ;
echo "<br> ";
echo $a/$b ;
echo "<br> ";
echo "<br> ";
$c = 15;
$d =2;
$result = $c + $d;
echo $result;
echo "<br> ";
echo "<br> ";
$c = 5;
echo $a + $b + $c;
echo "<br> ";echo "<br> ";
$c = $a -  $b;
$d = 7;
echo "<br> ";
$result = $c + $d;
echo "<br> ";
echo $result;
