<?php
//Работа со строками
// Создайте переменную $text и присвойте ей значение 'Привет, Мир!'.
// Выведите значение этой переменной на экран.
//
//Создайте переменные $text1='Привет, ' и $text2='Мир!'. С помощью этих
// переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.
//
//Создайте переменную $name и присвойте ей ваше имя. Выведите на экран
// фразу 'Привет, %Имя%!'. Вместо %Имя% должно стоять ваше имя.
//
//Создайте переменную $age и присвойте ей ваш возраст.
// Выведите на экран 'Мне %Возраст% лет!'.
// $text = 'Hello , world!';
// echo $text;
// $text1 = 'Hello, ';
// $text2 = 'World!';
// echo $text1.$text2;
 $name = 'Dmytro';
 $age = 26;
 echo "My age is $age";
 echo "<br>";
 echo "hello %$name%! ";
